korean_stopwords = [
    '의', '가', '이', '은', '들', '는', '좀', '잘', '걍', '과', '도', '를', '으로', '자', '에', '와', '한', '하다', '있다',
    '수', '그', '다', '같이', '더', '그리고', '중', '또한', '그러나', '등', '고', '것', '위', '지난', '이번', '이후',
    '지난해', '개월', '오전', '랍니', '그룹', '모든', '어디', '최근', '오늘', '각각', '통한', '매년', '위해', '앞서',
    '오른', '대한', '라며', '내년', '대해', '때문', '면서', '현재', '지난달', '비롯', '관련', '올해', '업계', '시장',
    '임시', '기업', '기술', '본부', '목표', '현지', '수요', '증가', '하락', '감소', '상승', '기반', '필수', '책임',
    '행복', '산업', '분야', '제품', '서비스', '회사', '개발', '사업', '업체', '프로젝트', '활동', '계획', '제공',
    '목적', '관리', '운영', '체계', '전략', '포함', '분석', '도입', '지원', '적용', '중심', '대상', '기존', '주요',
    '기능', '활용', '발전', '조직', '수준', '기회', '선도', '영향', '관점', '요인', '요소', '동향', '기초', '비중',
    '결과', '방안', '내용', '효과', '대응', '자원', '활성화', '진행', '확대', '방향', '최고', '유지', '환경', '최대',
    '최소', '요구', '제한', '개선', '변화', '신뢰', '강화', '확인', '성공', '실현', '구현', '증대', '진출', '기술력',
    '확장', '구조', '성과', '확립', '통합', '재편', '규모', '종합', '이해', '필요', '가격', '최초', '국내', '비상', '경계',
    '전문가', '사용', '대부분', '모두', '전체', '대상자', '기반', '향후', '측면', '상황', '조사', '자료', '정보',
    '방법', '발표', '수집', '해당', '경우', '사항', '내부', '외부', '추가', '참고', '사용자', '성장', '관련자',
    '연구', '테스트', '인식', '필요성', '효과성', '기여', '형태', '이점', '장점', '단점', '대안', '이상', '이하',
    '결정', '기본', '차이', '단계', '요소', '결과물', '특징', '특성', '개념', '단서', '방식', '방안', '통해', '과정',
    '연간', '달성', '단위', '지금', '이용', '이용자', '세계', '전세계'
]
