industry_keywords = {
    '자동차': [
        '자동차', '차량', '엔진', '전기차', '자율','주행', '내연기관', '배터리', '브레이크', '변속기', '타이어',
        '차체', '트럭', '에어백', '연료', '수소차', '모터', '서스펜션', '카메라', '미쉐린',
        '센서', '내비게이션', '휠', '디젤', '차선', '도어', '핸들', '패달', '안전벨트','르노',
        '현대차', '기아', '테슬라', '모비스', '금호', '만도', '모빌리티', '볼보', '폭스바겐',
    ],
    '반도체': [
        '반도체', '칩', '메모리', '웨이퍼', '공정', '프로세서', '트랜지스터', '소자', '나노', '센서',
        '집적회로', '전력', '다이오드', '회로', '모듈', '패키징', '레지스터', '트리거', '코일',
        '컨덴서', '밸런서', '에칭', '로직',  '디램', '플래시', '스퀘어', '리노', '실리콘',
        '삼성', '하이닉스'  '인텔', '엔비디아', '파운드리', '미세', '공정', '결정', '전자', '팹리스',
    ],
    '바이오헬스': [
        '바이오', '의료', '백신', '치료제', '유전자', '신약', '의약품', '임상', '제약', '세포','배양', '심장',
        '암', '면역', '항체', '치료', '유전', '진단', '영상', '분석', '의사', '혈액', '건강', '치매',
        '병원', '환자', '기기', '데이터', '검사', '시험', '예방', '재생', '의료', '복지', '헌혈', '임플란트',
        '셀트리온', '릴리', '유전체', '분자', '고분자', '식물', '생명', '당뇨', '피부', '생물',
    ],
    '정보통신기기': [
        '통신', '네트워크', '라우터', '기지국', '안테나', '음성', '스마트폰', '모바일', '데이터', '위성',
        '광통신', '센서', '서버', '인터넷', '모듈', '보안', '프로토콜', '클라우드', '웨어러블', '채널',
        '전송', '음성', '신호', '데이터센터', '기기', '케이블', '컴퓨터', '모뎀', '전파', '망',
        '아이폰', '갤럭시', '유플러스', '주파수', '무선', '유선', '텔레콤', '이노텍',
    ],
    '가전': [
        '가전', '냉장고', '세탁기', '에어컨', '로봇', '티비', '밥솥', '오븐', '청소기', '스피커', '스탠드',
        '조명', '가습기', '제습기','정수기', '냉동고', '전자레인지', '전기', '히터', '건조기', '식기', 
        '냉방','난방', '미러', '프로젝터', '조명', '스마트폰', '디스플레이', '온풍기', '비디오', '라디오',
        '쿠쿠', '코웨이', '경동', '나비엔', '다이슨', '위니아', '샤오미', '보일러',

    ],
    '철강': [
        '철강', '고철', '강재', '강판', '철광석', '압연', '제강', '용광로', '스테인리스', '합금',
        '후판', '철근', '강철', '선재', '압출', '제선', '고로', '코일', '도금', '철근',
        '도금', '냉연', '열연', '강봉', '철심', '강관', '선박', '구리', '탄소', '철분',
        '주물', '주조', '철회로', '용접', '강괴', '제련', '철제', '코일', '제련소',
        '포스코', '제철', '동국', '세아', '고려아연', '스틸',
    ],
    '정유': [
        '정유', '석유', '휘발유', '디젤', '원유', '정제', '가솔린', '프로판', '부탄', '중질유',
        '경질유', '윤활유', '가스', '에너지', '천연가스', '연료', '오일', '비축', '배럴',
        '정유사', '가스처리', '탱크', '공정', '파이프', '압축', '보일러', '산화', '증류', '파이프라인',
        '이노베이션', '에쓰오일', '칼텍스', 

    ],
    '석유화학': [
        '석유화학', '플라스틱', '폴리머', '에틸렌', '프로필렌', '합성수지', '나프타', '화학섬유', '화학제품', '페놀',
        '벤젠', '톨루엔', '자일렌', '합성섬유', '폴리에틸렌', '폴리프로필렌', '스티렌', '아크릴', '에폭시',
        '화학', '촉매', '정제', '연료', '화학공정', '탄소', '합성', '폴리우레탄', '에스테르', '탄화수소',
        '염화', '염료', '고무', '수지', '케미칼', 
    ],
    '이차전지': [
        '이차전지', '배터리', '리튬', '셀', '전력', '전지', '음극재', '양극재', '전해질', '전류',
        '전압', '충전기', '밀도', '방전', '관리', '리튬이온', '전력저장', '전지팩', '코발트', '망간',
        '니켈', '수명', '팩', '회로', '저장소', '안전성', '고체전해질', '충전', '분리막',
    ],
    '디스플레이': [
        '디스플레이', '화면', '화소', '패널', '백라이트', '터치스크린', '해상도', '곡면', '플렉시블', 
        '조도', '픽셀', '명암비', '컬러', '비율', '두께', '베젤', '모니터', '필름',
        '밝기', '곡률', '디지털', '모듈', '스크린', '화질', '플라스마', '프로젝터', '터치',
    ],
    '금융': [
        '금융', '은행', '증권', '보험', '자산', '펀드', '대출', '투자', '주식', '채권', '카드',
        '이자', '신용', '연금', '코인', '비트코인', '블록체인', '외환', '리스크', '금리', '수익', '예금',
        '자산', '모기지', '자동화', '지점', '대차', '분석', '회계', '지불', '채무', '현금',
        '유동성', '파생', '차입', '배당', '배당금', '보증', '보증금', '사모', '헤지', '부채', '환율',
        '지주', '하나', '신한', '국민', '농협', '우리', '뱅크', '국민연금', '미래에셋',
    ],
    'IT': [
        '소프트웨어', '하드웨어', '데이터', '서버', '프로그래밍', '알고리즘', '코딩', '네트워크', '클라우드', '인공','지능',
        '컴퓨터', '보안', '디지털', '프레임워크', '데이터베이스', '모바일', '애플리케이션', '인터넷', '머신', '러닝',
        '웹', '암호', '디바이스', '노드', '파일', '프로토콜', '자동화', '버그', '플랫폼', '앱', '개발자',
        '네이버', '카카오', '구글', '삼성', '애플', '마이크로소프트', '아마존', '엔씨소프트',
    ],
    '섬유': [
        '섬유', '직물', '의류', '원단', '니트', '폴리에스터', '면', '패션', '염색', '봉제',
         '자켓','재봉', '울', '견', '천', '레이온', '스판덱스', '리넨', '직조', '실크','린넨',
        '양모', '나일론', '인견', '직조기', '벨벳','캐시미어', '아크릴', '방적', '탄소섬유',
        '밍크', '블라우스', '모피', '아웃도어',
    ],
    '조선': [
        '조선', '선박', '조선소', '해양', '배', '물류', '해운', '탱커', '컨테이너', '컨테이너선', '선박용',
        '추진', '엔진', '프로펠러', '항해', '조타', '설비', '용접', '선체', '조선업', '항구',
        '항만', '화물', '물동량', '로로선', '플랜트', '파이프', '방수', '기름', '부유식', '드라이도크',
        '화물선', '상선', '크루즈선', '유조선', '내항선', '중공업',
    ],
    '일반기계': [
        '기계', '설비', '장비', '모터', '공장', '자동화', '로봇', '산업', '가공', '건설', '우주', 
        '물류', '자동화', '펌프', '밸브', '컨베이어', '유압', '엔진', '압축기', '배관', '터빈', 
        '센서', '기어', '베어링', '구동', '컴프레서', '연마', '절단', '주조', '냉각', '프로세스',
        '동력', '플랜트', '연삭', '공압', '유체', '로템', '전동기', '제어', '방산',
    ]
}
